In [1]:
import numpy as np

In [2]:
import seaborn as sns

In [3]:
import pandas as pd

In [ ]:
# Load the built-in 'tips' dataset from Seaborn into a DataFrame

df = sns.load_dataset('tips')

In [41]:
# Export DataFrame to CSV file
# here , index=False -> does not save the row numbers (index) in the file

df.to_csv('tips.csv',index=False)

In [40]:
# Load CSV file into DataFrame

df2 = pd.read_csv('tips.csv')

In [7]:
df2

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
# creates a Pandas Series using a dictionary where dictionary keys become the index and values become the data.

x=pd.Series({'a': 1, 'b': 2})
x

a    1
b    2
dtype: int64

In [43]:
# Display summary of satistics 

df2.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [44]:
df2[df2['total_bill'] >= 20 ]

     total_bill   tip     sex smoker  day    time  size
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
5         25.29  4.71    Male     No  Sun  Dinner     4
7         26.88  3.12    Male     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
237       32.83  1.17    Male    Yes  Sat  Dinner     2
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2

[97 rows x 7 columns]

In [45]:
# titanic dataset 

df3 = sns.load_dataset('titanic')

In [12]:
df3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [46]:
# to count the number of missing values in each column

df3.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [47]:
# Remove rows with missing values

df4 = df3.dropna()

In [48]:
df4.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [49]:
df4

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [50]:
# display age column 

df3['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [ ]:
# all missing value will be filled with zero in age column 
# output will be series 

df5 = df3['age' ]= df3['age'].fillna(0)

In [52]:
df5

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     0.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [57]:
# original dataframe remains unchanged 
# output will be dataframe

df5 = df3[['age']].fillna(0)

In [58]:
df5

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   0.0
889  26.0
890  32.0

[891 rows x 1 columns]

In [22]:
df3.loc[2] # 2 is index name , it can be a,b,c

survived                 1
pclass                   3
sex                 female
age                   26.0
sibsp                    0
parch                    0
fare                 7.925
embarked                 S
class                Third
who                  woman
adult_male           False
deck                   NaN
embark_town    Southampton
alive                  yes
alone                 True
Name: 2, dtype: object

In [23]:
df3.iloc[[0,2]]   # 0, 2 is index number

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.250,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.925,S,Third,woman,False,NaN,Southampton,yes,True

In [24]:
employees = pd.DataFrame({
"EmpID": [1, 2, 3],
"Name": ["Alice", "Bob", "Charlie"],
"DeptID": [10, 20, 30]
})
departments = pd.DataFrame({
"DeptID": [10, 20, 40],
"DeptName": ["HR", "Engineering", "Marketing"],
"Salary":['20000','100001','60000']
})

In [25]:
employees

   EmpID     Name  DeptID
0      1    Alice      10
1      2      Bob      20
2      3  Charlie      30

In [26]:
departments

   DeptID     DeptName  Salary
0      10           HR   20000
1      20  Engineering  100001
2      40    Marketing   60000

In [27]:
pd.merge(employees , departments, on='DeptID')

   EmpID   Name  DeptID     DeptName  Salary
0      1  Alice      10           HR   20000
1      2    Bob      20  Engineering  100001

In [28]:
pd.merge(employees , departments, on='DeptID', how='left')

   EmpID     Name  DeptID     DeptName  Salary
0      1    Alice      10           HR   20000
1      2      Bob      20  Engineering  100001
2      3  Charlie      30          NaN     NaN

In [59]:
df6= pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob'],
    'Age': [25, 30, 25, 35, 30],
    'City': ['NY', 'LA', 'NY', 'Chicago', 'LA']
})
print("Original DataFrame:")
print(df6)

Original DataFrame:
      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
2    Alice   25       NY
3  Charlie   35  Chicago
4      Bob   30       LA

In [60]:
df6.duplicated()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [61]:
df6.drop_duplicates()

      Name  Age     City
0    Alice   25       NY
1      Bob   30       LA
3  Charlie   35  Chicago

In [62]:
df6.duplicated().sum()

np.int64(2)

In [63]:
df6.iloc[2]

Name    Alice
Age        25
City       NY
Name: 2, dtype: object

In [64]:
df7 = pd.DataFrame({
    'A': [1, 2],
    'B': [3, 4]
})

In [65]:
df7

   A  B
0  1  3
1  2  4

In [73]:
# map - applies a function to each element of the Series
# multiplies every value in column A by 10

df7['A'].map(lambda x: x * 10)

0    10
1    20
Name: A, dtype: int64

In [71]:
# apply = applies a function row-wise or column-wise to the DataFrame
# Calculate row-wise sum of columns A and B

df7.apply(lambda row: row['A'] + row['B'], axis=1)

0    4
1    6
dtype: int64

In [75]:
# applymap - applies a function to every single element of the DataFrame
# multiplies every value in the DataFrame by 2

df7.applymap(lambda x: x * 2)

/tmp/ipykernel_1778/4061339382.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df7.applymap(lambda x: x * 2)

   A  B
0  2  6
1  4  8